In [1]:
import pandas
import numpy

In [2]:
data = pandas.read_csv("GoldRate - History_Data.csv")
df = pandas.DataFrame(data)
df

            Date  22K Rate   24K Rate  Month  Year
0     02/01/2012  2,560.00   2,738.00      1  2012
1     03/01/2012  2,582.00   2,762.00      1  2012
2     04/01/2012  2,598.00   2,778.50      1  2012
3     05/01/2012  2,607.00   2,788.00      1  2012
4     06/01/2012  2,623.00   2,805.00      1  2012
...          ...       ...        ...    ...   ...
4764  19/07/2025  9,170.00  10,004.00      7  2025
4765  20/07/2025  9,170.00  10,004.00      7  2025
4766  21/07/2025  9,180.00  10,014.00      7  2025
4767  22/07/2025  9,285.00  10,129.00      7  2025
4768  23/07/2025  9,380.00  10,232.00      7  2025

[4769 rows x 5 columns]

In [ ]:
# target >>>